<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="?,3,416,416" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_17883" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="0" size="12" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Multiply_17893" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_17895" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="12" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Divide_7746" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_15950" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="24" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/backbone/stem/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stem/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/backbone/stem/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="48" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stem/Constant_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/backbone/stem/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/backbone/stem/Shape_1_output_0,/backbone/stem/Shape_2_output_0,/backbone/stem/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_15025" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="56" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_180" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="11" name="/backbone/stem/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/stem/Unsqueeze_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/backbone/stem/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/backbone/stem/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stem/Reshape_output_0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>2</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_15183" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="72" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_15184" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="Gather_15185" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_15959" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/backbone/stem/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="48" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stem/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/backbone/stem/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="40" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stem/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/backbone/stem/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="48" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stem/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/backbone/stem/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/backbone/stem/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>2</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="I64">
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stem/Reshape_1_output_0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_245" type="Const" version="opset1">
			<data element_type="i64" shape="6" offset="88" size="48" />
			<output>
				<port id="0" precision="I64">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/backbone/stem/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stem/Transpose_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_15049" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_171" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="27" name="/backbone/stem/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/stem/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/backbone/stem/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stem/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="29" name="Constant_176" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="30" name="/backbone/stem/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/stem/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="31" name="/backbone/stem/Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="144" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stem/Constant_15_output_0" />
			</output>
		</layer>
		<layer id="32" name="/backbone/stem/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stem/Mul_output_0" />
			</output>
		</layer>
		<layer id="33" name="Constant_251" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="64" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/backbone/stem/Unsqueeze_7" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stem/Unsqueeze_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/backbone/stem/Shape_4" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/backbone/stem/Shape_4_output_0,/backbone/stem/Shape_5_output_0">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_15188" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="152" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_15189" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="38" name="Gather_15190" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>6</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/backbone/stem/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/stem/Concat_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/backbone/stem/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stem/Reshape_2_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>208</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="onnx::Conv_1325" type="Const" version="opset1">
			<data element_type="f32" shape="24, 12, 3, 3" offset="168" size="10368" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1325">
					<dim>24</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/backbone/stem/conv/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>208</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>208</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Reshape_288" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="10536" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/backbone/stem/conv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>208</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stem/conv/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>208</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/backbone/stem/conv/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>208</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stem/conv/activate/Mul_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>208</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="onnx::Conv_1328" type="Const" version="opset1">
			<data element_type="f32" shape="48, 24, 3, 3" offset="10632" size="41472" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1328">
					<dim>48</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/backbone/stage1/stage1.0/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>208</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Reshape_305" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="52104" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/backbone/stage1/stage1.0/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/stage1.0/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/backbone/stage1/stage1.0/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/stage1.0/activate/Mul_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="onnx::Conv_1334" type="Const" version="opset1">
			<data element_type="f32" shape="24, 48, 1, 1" offset="52296" size="4608" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1334">
					<dim>24</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/backbone/stage1/stage1.1/main_conv/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Reshape_339" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="56904" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/backbone/stage1/stage1.1/main_conv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/stage1.1/main_conv/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/backbone/stage1/stage1.1/main_conv/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/stage1.1/main_conv/activate/Mul_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="onnx::Conv_1337" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 1, 1" offset="57000" size="2304" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1337">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/backbone/stage1/stage1.1/blocks/blocks.0/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Reshape_356" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="59304" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/backbone/stage1/stage1.1/blocks/blocks.0/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/stage1.1/blocks/blocks.0/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/backbone/stage1/stage1.1/blocks/blocks.0/conv1/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/stage1.1/blocks/blocks.0/conv1/activate/Mul_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="onnx::Conv_1340" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 3, 3" offset="59400" size="20736" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1340">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/backbone/stage1/stage1.1/blocks/blocks.0/conv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Reshape_373" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="80136" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/backbone/stage1/stage1.1/blocks/blocks.0/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/stage1.1/blocks/blocks.0/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/backbone/stage1/stage1.1/blocks/blocks.0/conv2/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/stage1.1/blocks/blocks.0/conv2/activate/Mul_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/backbone/stage1/stage1.1/blocks/blocks.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/stage1.1/blocks/blocks.0/Add_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="onnx::Conv_1331" type="Const" version="opset1">
			<data element_type="f32" shape="24, 48, 1, 1" offset="80232" size="4608" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1331">
					<dim>24</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/backbone/stage1/stage1.1/short_conv/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Reshape_322" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="84840" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/backbone/stage1/stage1.1/short_conv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/stage1.1/short_conv/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/backbone/stage1/stage1.1/short_conv/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/stage1.1/short_conv/activate/Mul_output_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/backbone/stage1/stage1.1/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/stage1.1/Concat_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="onnx::Conv_1343" type="Const" version="opset1">
			<data element_type="f32" shape="48, 48, 1, 1" offset="84936" size="9216" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1343">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/backbone/stage1/stage1.1/final_conv/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_392" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="94152" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/backbone/stage1/stage1.1/final_conv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/stage1.1/final_conv/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/backbone/stage1/stage1.1/final_conv/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/stage1.1/final_conv/activate/Mul_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="onnx::Conv_1346" type="Const" version="opset1">
			<data element_type="f32" shape="96, 48, 3, 3" offset="94344" size="165888" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1346">
					<dim>96</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/backbone/stage2/stage2.0/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>104</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_409" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="260232" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/backbone/stage2/stage2.0/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/stage2.0/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/backbone/stage2/stage2.0/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/stage2.0/activate/Mul_output_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="onnx::Conv_1352" type="Const" version="opset1">
			<data element_type="f32" shape="48, 96, 1, 1" offset="260616" size="18432" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1352">
					<dim>48</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/backbone/stage2/stage2.1/main_conv/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Reshape_443" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="279048" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/backbone/stage2/stage2.1/main_conv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/stage2.1/main_conv/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/backbone/stage2/stage2.1/main_conv/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/stage2.1/main_conv/activate/Mul_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="onnx::Conv_1355" type="Const" version="opset1">
			<data element_type="f32" shape="48, 48, 1, 1" offset="279240" size="9216" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1355">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/backbone/stage2/stage2.1/blocks/blocks.0/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Reshape_460" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="288456" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/backbone/stage2/stage2.1/blocks/blocks.0/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/stage2.1/blocks/blocks.0/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/backbone/stage2/stage2.1/blocks/blocks.0/conv1/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/stage2.1/blocks/blocks.0/conv1/activate/Mul_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="onnx::Conv_1358" type="Const" version="opset1">
			<data element_type="f32" shape="48, 48, 3, 3" offset="288648" size="82944" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1358">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/backbone/stage2/stage2.1/blocks/blocks.0/conv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Reshape_477" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="371592" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/backbone/stage2/stage2.1/blocks/blocks.0/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/stage2.1/blocks/blocks.0/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/backbone/stage2/stage2.1/blocks/blocks.0/conv2/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/stage2.1/blocks/blocks.0/conv2/activate/Mul_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/backbone/stage2/stage2.1/blocks/blocks.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/stage2.1/blocks/blocks.0/Add_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="onnx::Conv_1361" type="Const" version="opset1">
			<data element_type="f32" shape="48, 48, 1, 1" offset="371784" size="9216" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1361">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/backbone/stage2/stage2.1/blocks/blocks.1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_495" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="381000" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/backbone/stage2/stage2.1/blocks/blocks.1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/stage2.1/blocks/blocks.1/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/backbone/stage2/stage2.1/blocks/blocks.1/conv1/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/stage2.1/blocks/blocks.1/conv1/activate/Mul_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="onnx::Conv_1364" type="Const" version="opset1">
			<data element_type="f32" shape="48, 48, 3, 3" offset="381192" size="82944" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1364">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/backbone/stage2/stage2.1/blocks/blocks.1/conv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Reshape_512" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="464136" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/backbone/stage2/stage2.1/blocks/blocks.1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/stage2.1/blocks/blocks.1/conv2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/backbone/stage2/stage2.1/blocks/blocks.1/conv2/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage2/stage2.1/blocks/blocks.1/conv2/activate/Mul_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/backbone/stage2/stage2.1/blocks/blocks.1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/stage2.1/blocks/blocks.1/Add_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="onnx::Conv_1367" type="Const" version="opset1">
			<data element_type="f32" shape="48, 48, 1, 1" offset="464328" size="9216" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_1367">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/backbone/stage2/stage2.1/blocks/blocks.2/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Reshape_530" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="473544" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/backbone/stage2/stage2.1/blocks/blocks.2/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage2/stage2.1/blocks/blocks.2/conv1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/backbone/stage2/stage2.1/blocks/blocks.2/conv1/activate/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>52</dim>
					<dim>-1</dim>
				</port>
